commons/commons-webservice-axis/src/test/resources/soap/twoparameters_security.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
         soapenv:mustUnderstand="1">
         <wsse:UsernameToken
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
            wsu:Id="UsernameToken-1">
            <wsse:Username>myuser</wsse:Username>
            <wsse:Password
               Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">vCcz6AkpJbeEbyCbv2Tpd4HIP5w=</wsse:Password>
            <wsse:Nonce
               EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">SADtkeANnP/3yZqd9yHRlg==</wsse:Nonce>
            <wsu:Created>2011-03-11T13:59:01.608Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <wsa:To>http://localhost:8082/axis2/services/Axis2UserGuideService/
      </wsa:To>
      <wsa:MessageID>urn:uuid:2F23D4EE2C944E5A181299851940998
      </wsa:MessageID>
      <wsa:Action>TwoWayOneParameterEcho</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:TwoWayOneParameterEchoRequest
         xmlns:ns1="http://apache.org/axis2/Axis2UserGuide">
         <ns1:echoString>echo</ns1:echoString>
      </ns1:TwoWayOneParameterEchoRequest>
   </soapenv:Body>
</soapenv:Envelope>